sorosaulong-ux/gd32-test-project/Library/gd32a7xx_i2c.h
/* defines which bits of ADDRESS2[7:1] are compared with an incoming address byte, and which bits are masked (don't care) */
#define ADDRESS2_NO_MASK                ((uint32_t)0x00000000U)         /*!< no mask, all the bits must be compared */
#define ADDRESS2_MASK_BIT1              ((uint32_t)0x00000001U)         /*!< ADDRESS2[1] is masked, only ADDRESS2[7:2] are compared */
#define ADDRESS2_MASK_BIT1_2            ((uint32_t)0x00000002U)         /*!< ADDRESS2[2:1] is masked, only ADDRESS2[7:3] are compared */
#define ADDRESS2_MASK_BIT1_3            ((uint32_t)0x00000003U)         /*!< ADDRESS2[3:1] is masked, only ADDRESS2[7:4] are compared */
#define ADDRESS2_MASK_BIT1_4            ((uint32_t)0x00000004U)         /*!< ADDRESS2[4:1] is masked, only ADDRESS2[7:5] are compared */
#define ADDRESS2_MASK_BIT1_5            ((uint32_t)0x00000005U)         /*!< ADDRESS2[5:1] is masked, only ADDRESS2[7:6] are compared */
#define ADDRESS2_MASK_BIT1_6            ((uint32_t)0x00000006U)         /*!< ADDRESS2[6:1] is masked, only ADDRESS2[7] are compared */
#define ADDRESS2_MASK_ALL               ((uint32_t)0x00000007U)         /*!< all the ADDRESS2[7:1] bits are masked */

/* idle clock timeout detection */
#define BUSTOA_DETECT_SCL_LOW           ((uint32_t)0x00000000U)         /*!< BUSTOA is used to detect SCL low timeout */
#define BUSTOA_DETECT_IDLE              I2C_TIMEOUT_TOIDLE              /*!< BUSTOA is used to detect both SCL and SDA high timeout when the bus is idle */

/* I2C flag definitions */
#define I2C_FLAG_TBE                    I2C_STAT_TBE                    /*!< I2C_TDATA is empty during transmitting */
#define I2C_FLAG_TI                     I2C_STAT_TI                     /*!< transmit interrupt */
#define I2C_FLAG_RBNE                   I2C_STAT_RBNE                   /*!< I2C_RDATA is not empty during receiving */
#define I2C_FLAG_ADDSEND                I2C_STAT_ADDSEND                /*!< address received matches in slave mode */
#define I2C_FLAG_NACK                   I2C_STAT_NACK                   /*!< not acknowledge flag */
#define I2C_FLAG_STPDET                 I2C_STAT_STPDET                 /*!< STOP condition detected in slave mode */
#define I2C_FLAG_TC                     I2C_STAT_TC                     /*!< transfer complete in master mode */
#define I2C_FLAG_TCR                    I2C_STAT_TCR                    /*!< transfer complete reload */
#define I2C_FLAG_BERR                   I2C_STAT_BERR                   /*!< bus error */
#define I2C_FLAG_LOSTARB                I2C_STAT_LOSTARB                /*!< arbitration lost */
#define I2C_FLAG_OUERR                  I2C_STAT_OUERR                  /*!< overrun/underrun error in slave mode */
#define I2C_FLAG_PECERR                 I2C_STAT_PECERR                 /*!< PEC error */
#define I2C_FLAG_TIMEOUT                I2C_STAT_TIMEOUT                /*!< timeout flag */
#define I2C_FLAG_SMBALT                 I2C_STAT_SMBALT                 /*!< SMBus Alert */
#define I2C_FLAG_I2CBSY                 I2C_STAT_I2CBSY                 /*!< busy flag */
#define I2C_FLAG_TR                     I2C_STAT_TR                     /*!< whether the I2C is a transmitter or a receiver in slave mode */

/* parameter check definitions */
#ifdef FW_DEBUG_ERR_REPORT
/* check peripherals */
#define NOT_I2C_PERIPH(periph)                           (((periph) != I2C0) && ((periph) != I2C1))

/* check the frequency division factor */
#define I2C_PSC_HIGH_VALUE                               ((uint32_t)0x0000000FU)        /*!< maximum prescaler value */
#define NOT_I2C_PSC(psc)                                 (I2C_PSC_HIGH_VALUE < (psc))

/* check data setup time */
#define SCL_DELY_HIGH_VALUE                              ((uint32_t)0x0000000FU)        /*!< maximum SCL delay value */
#define NOT_I2C_SCL_DELY(scl_dely)                       (SCL_DELY_HIGH_VALUE < (scl_dely))

/* check data hold time */
#define SDA_DELY_HIGH_VALUE                              ((uint32_t)0x0000000FU)        /*!< maximum SDA delay value */
#define NOT_I2C_SDA_DELY(sda_dely)                       (SDA_DELY_HIGH_VALUE < (sda_dely))

/* check the length of filter spikes */
#define FILTER_LENGTH_HIGH_VALUE                         ((uint32_t)0x0000000FU)        /*!< maximum filter spikes length value */
#define NOT_I2C_FILTER_LENGTH(filter_length)             (FILTER_LENGTH_HIGH_VALUE < (filter_length))

/* check SCL high period */
#define SCLH_HIGH_VALUE                                  ((uint32_t)0x000000FFU)        /*!< maximum SCL high period value */
#define NOT_I2C_SCLH(sclh)                               (SCLH_HIGH_VALUE < (sclh))

/* check SCL low period */
#define SCLL_HIGH_VALUE                                  ((uint32_t)0x000000FFU)        /*!< maximum SCL low period value */
#define NOT_I2C_SCLL(scll)                               (SCLL_HIGH_VALUE < (scll))

/* check I2C slave address */
#define ADDRESS_HIGH_VALUE                               ((uint32_t)0x000003FFU)        /*!< maximum I2C slave address value */
#define NOT_I2C_ADDRESS(address)                         (ADDRESS_HIGH_VALUE < (address))

/* check I2C transfer direction in master mode */
#define NOT_I2C_TRANS_DIRECTION(trans_direction)         (((trans_direction) != I2C_MASTER_TRANSMIT) && \
                                                          ((trans_direction) != I2C_MASTER_RECEIVE))

/* check I2C slave address mode */
#define NOT_I2C_ADDR_FORMAT(addr_format)                 (((addr_format) != I2C_ADDFORMAT_7BITS) && \
                                                          ((addr_format) != I2C_ADDFORMAT_10BITS))
/* check the bits need to compare */
#define CMOMPARE_BITS_HIGH_VALUE                         ((uint32_t)0x0000007F)         /* maximum compared value */
#define NOT_I2C_COMPARE_BITS(compare_bits)               (CMOMPARE_BITS_HIGH_VALUE < (compare_bits))

/* check I2C slave second address */
#define SECOND_ADDRESS_HIGH_VALUE                        ((uint32_t)0x000000FEU)        /*!< maximum I2C slave second address value */
#define NOT_I2C_SECOND_ADDRESS(address)                  (SECOND_ADDRESS_HIGH_VALUE < (address))

/* check the bits not need to compare */
#define NOT_I2C_ADDR_MASK(addr_mask)                     (((addr_mask) != ADDRESS2_NO_MASK) && \
                                                          ((addr_mask) != ADDRESS2_MASK_BIT1) && \
                                                          ((addr_mask) != ADDRESS2_MASK_BIT1_2) && \
                                                          ((addr_mask) != ADDRESS2_MASK_BIT1_3) && \
                                                          ((addr_mask) != ADDRESS2_MASK_BIT1_4) && \
                                                          ((addr_mask) != ADDRESS2_MASK_BIT1_5) && \
                                                          ((addr_mask) != ADDRESS2_MASK_BIT1_6) && \
                                                          ((addr_mask) != ADDRESS2_MASK_ALL))

/* check the bits not need to compare */
#define NOT_I2C_DMA(dma)                                 (((dma) != I2C_DMA_TRANSMIT) && \
                                                          ((dma) != I2C_DMA_RECEIVE))

/* check bus timeout value */
#define TIMEOUT_HIGH_VALUE                               ((uint32_t)0x00000FFFU)        /*!< maximum bus timeout value */
#define NOT_I2C_TIMEOUT(timeout)                         (TIMEOUT_HIGH_VALUE < (timeout))

/* check idle clock timeout detection content */
#define NOT_I2C_TIMEOUT_DET(timeout)                     (((timeout) != BUSTOA_DETECT_SCL_LOW) && \
                                                          ((timeout) != BUSTOA_DETECT_IDLE))

