sorosaulong-ux/gd32-test-project/Library/gd32a7xx_i2c.h
/* check I2C flag status */
#define NOT_I2C_STAT_FALG(flag)                          (((flag) != I2C_FLAG_TBE) && \
                                                          ((flag) != I2C_FLAG_TI) && \
                                                          ((flag) != I2C_FLAG_RBNE) && \
                                                          ((flag) != I2C_FLAG_ADDSEND) && \
                                                          ((flag) != I2C_FLAG_NACK) && \
                                                          ((flag) != I2C_FLAG_STPDET) && \
                                                          ((flag) != I2C_FLAG_TC) && \
                                                          ((flag) != I2C_FLAG_TCR) && \
                                                          ((flag) != I2C_FLAG_BERR) && \
                                                          ((flag) != I2C_FLAG_LOSTARB) && \
                                                          ((flag) != I2C_FLAG_OUERR) && \
                                                          ((flag) != I2C_FLAG_PECERR) && \
                                                          ((flag) != I2C_FLAG_TIMEOUT) && \
                                                          ((flag) != I2C_FLAG_SMBALT) && \
                                                          ((flag) != I2C_FLAG_I2CBSY) && \
                                                          ((flag) != I2C_FLAG_TR))

/* check I2C flag(which can be cleared) status */
#define NOT_I2C_STAT_CLEAR_FALG(flag)                    (((flag) != I2C_FLAG_ADDSEND) && \
                                                          ((flag) != I2C_FLAG_NACK) && \
                                                          ((flag) != I2C_FLAG_STPDET) && \
                                                          ((flag) != I2C_FLAG_BERR) && \
                                                          ((flag) != I2C_FLAG_LOSTARB) && \
                                                          ((flag) != I2C_FLAG_OUERR) && \
                                                          ((flag) != I2C_FLAG_PECERR) && \
                                                          ((flag) != I2C_FLAG_TIMEOUT) && \
                                                          ((flag) != I2C_FLAG_SMBALT))

/* check I2C interrupt */
#define NOT_I2C_INT(interrupt)                           (((interrupt) != I2C_INT_ERR) && \
                                                          ((interrupt) != I2C_INT_TC) && \
                                                          ((interrupt) != I2C_INT_STPDET) && \
                                                          ((interrupt) != I2C_INT_NACK) && \
                                                          ((interrupt) != I2C_INT_ADDM) && \
                                                          ((interrupt) != I2C_INT_RBNE) && \
                                                          ((interrupt) != I2C_INT_TI))

/* check I2C interrupt flag(which can be cleared) status */
#define NOT_I2C_INT_CLEAR_FLAG(int_flag)                 (((int_flag) != I2C_INT_FLAG_ADDSEND) && \
                                                          ((int_flag) != I2C_INT_FLAG_NACK) && \
                                                          ((int_flag) != I2C_INT_FLAG_STPDET) && \
                                                          ((int_flag) != I2C_INT_FLAG_BERR) && \
                                                          ((int_flag) != I2C_INT_FLAG_LOSTARB) && \
                                                          ((int_flag) != I2C_INT_FLAG_OUERR) && \
                                                          ((int_flag) != I2C_INT_FLAG_PECERR) && \
                                                          ((int_flag) != I2C_INT_FLAG_TIMEOUT) && \
                                                          ((int_flag) != I2C_INT_FLAG_SMBALT))

#endif

/* function declarations */
/* initialization functions */
/* reset I2C */
void i2c_deinit(uint32_t i2c_periph);
/* configure the timing parameters */
void i2c_timing_config(uint32_t i2c_periph, uint32_t psc, uint32_t scl_dely, uint32_t sda_dely);
/* configure digital noise filter */
void i2c_digital_noise_filter_config(uint32_t i2c_periph, uint32_t filter_length);
/* enable analog noise filter */
void i2c_analog_noise_filter_enable(uint32_t i2c_periph);
/* disable analog noise filter */
void i2c_analog_noise_filter_disable(uint32_t i2c_periph);
/* configure the SCL high and low period of clock in master mode */
void i2c_master_clock_config(uint32_t i2c_periph, uint32_t sclh, uint32_t scll);
/* configure i2c slave address and transfer direction in master mode */
void i2c_master_addressing(uint32_t i2c_periph, uint32_t address, uint32_t trans_direction);

/* application function declarations */
/* 10-bit address header executes read direction only in master receive mode */
void i2c_address10_header_enable(uint32_t i2c_periph);
/* 10-bit address header executes complete sequence in master receive mode */
void i2c_address10_header_disable(uint32_t i2c_periph);
/* enable 10-bit addressing mode in master mode */
void i2c_address10_enable(uint32_t i2c_periph);
/* disable 10-bit addressing mode in master mode */
void i2c_address10_disable(uint32_t i2c_periph);
/* enable I2C automatic end mode in master mode */
void i2c_automatic_end_enable(uint32_t i2c_periph);
/* disable I2C automatic end mode in master mode */
void i2c_automatic_end_disable(uint32_t i2c_periph);
/* enable the response to a general call */
void i2c_slave_response_to_gcall_enable(uint32_t i2c_periph);
/* disable the response to a general call */
void i2c_slave_response_to_gcall_disable(uint32_t i2c_periph);
/* enable to stretch SCL low when data is not ready in slave mode */
void i2c_stretch_scl_low_enable(uint32_t i2c_periph);
/* disable to stretch SCL low when data is not ready in slave mode */
void i2c_stretch_scl_low_disable(uint32_t i2c_periph);
/* configure i2c slave address */
void i2c_address_config(uint32_t i2c_periph, uint32_t address, uint32_t addr_format);
/* define which bits of ADDRESS[7:1] need to compare with the incoming address byte */
void i2c_address_bit_compare_config(uint32_t i2c_periph, uint32_t compare_bits);
/* disable i2c address in slave mode */
void i2c_address_disable(uint32_t i2c_periph);
/* configure i2c second slave address */
void i2c_second_address_config(uint32_t i2c_periph, uint32_t address, uint32_t addr_mask);
/* disable i2c second address in slave mode */
void i2c_second_address_disable(uint32_t i2c_periph);
/* get received match address in slave mode */
uint32_t i2c_recevied_address_get(uint32_t i2c_periph);
/* enable slave byte control */
void i2c_slave_byte_control_enable(uint32_t i2c_periph);
/* disable slave byte control */
void i2c_slave_byte_control_disable(uint32_t i2c_periph);
/* generate a NACK in slave mode */
void i2c_nack_enable(uint32_t i2c_periph);
/* enable I2C */
void i2c_enable(uint32_t i2c_periph);
/* disable I2C */
void i2c_disable(uint32_t i2c_periph);
/* generate a START condition on I2C bus */
void i2c_start_on_bus(uint32_t i2c_periph);
/* generate a STOP condition on I2C bus */
void i2c_stop_on_bus(uint32_t i2c_periph);
/* I2C transmit data */
void i2c_data_transmit(uint32_t i2c_periph, uint8_t data);
/* I2C receive data */
uint8_t i2c_data_receive(uint32_t i2c_periph);
/* enable I2C reload mode */
void i2c_reload_enable(uint32_t i2c_periph);
/* disable I2C reload mode */
void i2c_reload_disable(uint32_t i2c_periph);
/* configure number of bytes to be transferred */
void i2c_transfer_byte_number_config(uint32_t i2c_periph, uint8_t byte_number);
/* enable I2C DMA for transmission or reception */
void i2c_dma_enable(uint32_t i2c_periph, uint8_t dma);
/* disable I2C DMA for transmission or reception */
void i2c_dma_disable(uint32_t i2c_periph, uint8_t dma);
/* I2C transfers PEC value */
void i2c_pec_transfer(uint32_t i2c_periph);
/* enable I2C PEC calculation */
void i2c_pec_enable(uint32_t i2c_periph);
/* disable I2C PEC calculation */
void i2c_pec_disable(uint32_t i2c_periph);
/* get packet error checking value */
uint32_t i2c_pec_value_get(uint32_t i2c_periph);
/* enable SMBus alert */
void i2c_smbus_alert_enable(uint32_t i2c_periph);
/* disable SMBus alert */
void i2c_smbus_alert_disable(uint32_t i2c_periph);
/* enable SMBus device default address */
void i2c_smbus_default_addr_enable(uint32_t i2c_periph);
/* disable SMBus device default address */
void i2c_smbus_default_addr_disable(uint32_t i2c_periph);
/* enable SMBus host address */
void i2c_smbus_host_addr_enable(uint32_t i2c_periph);
/* disable SMBus host address */
void i2c_smbus_host_addr_disable(uint32_t i2c_periph);
/* enable extended clock timeout detection */
void i2c_extented_clock_timeout_enable(uint32_t i2c_periph);
/* disable extended clock timeout detection */
void i2c_extented_clock_timeout_disable(uint32_t i2c_periph);
/* enable clock timeout detection */
void i2c_clock_timeout_enable(uint32_t i2c_periph);
/* disable clock timeout detection */
void i2c_clock_timeout_disable(uint32_t i2c_periph);
/* configure bus timeout B */
void i2c_bus_timeout_b_config(uint32_t i2c_periph, uint32_t timeout);
/* configure bus timeout A */
void i2c_bus_timeout_a_config(uint32_t i2c_periph, uint32_t timeout);
/* configure idle clock timeout detection */
void i2c_idle_clock_timeout_config(uint32_t i2c_periph, uint32_t timeout);

/* interrupt & flag functions */
/* get I2C flag status */
FlagStatus i2c_flag_get(uint32_t i2c_periph, uint32_t flag);
/* clear I2C flag status */
void i2c_flag_clear(uint32_t i2c_periph, uint32_t flag);
/* enable I2C interrupt */
void i2c_interrupt_enable(uint32_t i2c_periph, uint32_t interrupt);
/* disable I2C interrupt */
void i2c_interrupt_disable(uint32_t i2c_periph, uint32_t interrupt);
/* get I2C interrupt flag status */
FlagStatus i2c_interrupt_flag_get(uint32_t i2c_periph, i2c_interrupt_flag_enum int_flag);
/* clear I2C interrupt flag status */
void i2c_interrupt_flag_clear(uint32_t i2c_periph, i2c_interrupt_flag_enum int_flag);

#endif /* GD32A7XX_I2C_H */
